## Plan Result (sbox-apim)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.api-mgmt.azurerm_public_ip.apim
* Replace
  * module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain
  * module.api-mgmt.azurerm_role_assignment.apim




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.api-mgmt.data.azurerm_api_management.apim will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_api_management" "apim"  {
      ~ additional_location       = [] -> (known after apply)
      ~ developer_portal_url      = "https://sds-api-mgmt-sbox.developer.azure-api.net" -> (known after apply)
      ~ gateway_regional_url      = "https://sds-api-mgmt-sbox-uksouth-01.regional.azure-api.net" -> (known after apply)
      ~ gateway_url               = "https://sds-api-mgmt-sbox.azure-api.net" -> (known after apply)
      ~ hostname_configuration    = [
          - {
              - developer_portal = []
              - management       = []
              - portal           = []
              - proxy            = [
                  - {
                      - default_ssl_binding          = false
                      - host_name                    = "sds-api-mgmt-sbox.azure-api.net"
                      - key_vault_id                 = ""
                      - negotiate_client_certificate = false
                    },
                  - {
                      - default_ssl_binding          = true
                      - host_name                    = "sds-api-mgmt.sandbox.platform.hmcts.net"
                      - key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
                      - negotiate_client_certificate = true
                    },
                  - {
                      - default_ssl_binding          = true
                      - host_name                    = "sds-api-mgmt-appgw.sandbox.platform.hmcts.net"
                      - key_vault_id                 = "https://acmedtssdssbox.vault.azure.net/secrets/wildcard-sandbox-platform-hmcts-net"
                      - negotiate_client_certificate = true
                    },
                ]
              - scm              = []
            },
        ] -> (known after apply)
      ~ id                        = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox" -> (known after apply)
      ~ identity                  = [
          - {
              - identity_ids = []
              - principal_id = "9e962e63-39f9-490e-8eb3-b01f29fbf2b2"
              - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
              - type         = "SystemAssigned"
            },
        ] -> (known after apply)
      ~ location                  = "uksouth" -> (known after apply)
      ~ management_api_url        = "https://sds-api-mgmt-sbox.management.azure-api.net" -> (known after apply)
        name                      = "sds-api-mgmt-sbox"
      ~ notification_sender_email = "apimgmt-noreply@mail.windowsazure.com" -> (known after apply)
      ~ portal_url                = "https://sds-api-mgmt-sbox.portal.azure-api.net" -> (known after apply)
      ~ private_ip_addresses      = [
          - "10.140.33.133",
        ] -> (known after apply)
      + public_ip_address_id      = (known after apply)
      ~ public_ip_addresses       = [
          - "20.117.129.45",
        ] -> (known after apply)
      ~ publisher_email           = "DTSPlatformOps@HMCTS.NET" -> (known after apply)
      ~ publisher_name            = "HMCTS Platform Operations" -> (known after apply)
      ~ scm_url                   = "https://sds-api-mgmt-sbox.scm.azure-api.net" -> (known after apply)
      ~ sku_name                  = "Developer_1" -> (known after apply)
      ~ tags                      = {
          - "application"  = "core"
          - "builtFrom"    = "hmcts/sds-azure-platform"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
        } -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain must be replaced
-/+ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
      ~ api_management_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox" -> (known after apply) # forces replacement
      ~ id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/customDomains/default" -> (known after apply)

      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
          + certificate_source           = (known after apply)
          + certificate_status           = (known after apply)
          + expiry                       = (known after apply)
          + subject                      = (known after apply)
          + thumbprint                   = (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.api-mgmt.azurerm_public_ip.apim will be updated in-place
  ~ resource "azurerm_public_ip" "apim" {
      + ddos_protection_mode    = "VirtualNetworkInherited"
        id                      = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/publicIPAddresses/sds-api-mgmt-sbox-private-pip"
        name                    = "sds-api-mgmt-sbox-private-pip"
        tags                    = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (12 unchanged attributes hidden)
    }

  # module.api-mgmt.azurerm_role_assignment.apim must be replaced
-/+ resource "azurerm_role_assignment" "apim" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/sds-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdssbox/providers/Microsoft.Authorization/roleAssignments/ee331d87-d46b-fb89-ad13-9b9e9a914cc0" -> (known after apply)
      ~ name                             = "ee331d87-d46b-fb89-ad13-9b9e9a914cc0" -> (known after apply)
      ~ principal_id                     = "9e962e63-39f9-490e-8eb3-b01f29fbf2b2" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.api-mgmt.azurerm_api_management_api.apim has been changed
  ~ resource "azurerm_api_management_api" "apim" {
      + api_type              = "http"
        id                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/apis/health"
        name                  = "health"
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.api-mgmt.azurerm_api_management_custom_domain.api-management-custom-domain has been changed
  ~ resource "azurerm_api_management_custom_domain" "api-management-custom-domain" {
        id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/customDomains/default"
        # (1 unchanged attribute hidden)

      ~ gateway {
            # (4 unchanged attributes hidden)
        }
      ~ gateway {
            # (4 unchanged attributes hidden)
        }
    }
  # module.api-mgmt.azurerm_application_insights.apim has been changed
  ~ resource "azurerm_application_insights" "apim" {
        id                                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Insights/components/sds-api-mgmt-sbox"
        name                                  = "sds-api-mgmt-sbox"
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (15 unchanged attributes hidden)
    }
  # module.api-mgmt.azurerm_api_management.apim has been changed
  ~ resource "azurerm_api_management" "apim" {
        id                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox"
        name                          = "sds-api-mgmt-sbox"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
        }
        # (20 unchanged attributes hidden)

      ~ hostname_configuration {

          ~ proxy {
              + certificate_source           = "BuiltIn"
                # (3 unchanged attributes hidden)
            }
          ~ proxy {
              + certificate_source           = "KeyVault"
                # (7 unchanged attributes hidden)
            }
          ~ proxy {
              + certificate_source           = "KeyVault"
                # (7 unchanged attributes hidden)
            }
        }







        # (7 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":173,"Program":"tfcmt","SHA1":"","Target":"sbox-apim","Vars":{}} -->